CONNECT TO POSTGRESQL

In [1]:
pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.9.10-cp39-cp39-win_amd64.whl.metadata (5.0 kB)
Downloading psycopg2-2.9.10-cp39-cp39-win_amd64.whl (1.2 MB)
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 1.2/1.2 MB 8.3 MB/s eta 0:00:00
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.10
Note: you may need to restart the kernel to use updated packages.

In [2]:
from sqlalchemy import text
from sqlalchemy import create_engine

In [5]:
eng_postgre = create_engine('postgresql+psycopg2://postgres:fyVA3BcTOFENZydZ@localhost:5432/Latihan')

In [6]:
with eng_postgre.connect() as con:
    value = con.execute(text('SELECT * FROM pegawai'))

In [14]:
value.fetchall()

[]

## Data Menggunakan Pandas

In [10]:
import pandas as pd

dummy = pd.DataFrame({'id':[1,2,3], 'name':['kiki','dini','rara'],'jabatan':['IT','Junior Programmer','HR']})

In [11]:
dummy

   id  name            jabatan
0   1  kiki                 IT
1   2  dini  Junior Programmer
2   3  rara                 HR

In [12]:
dummy.to_sql('pegawai', con=eng_postgre,if_exists='append',index=False)

3

In [18]:
pd.read_sql('pegawai',con=eng_postgre)

   id  name            jabatan
0   1  kiki                 IT
1   2  dini  Junior Programmer
2   3  rara                 HR

## Menambahkan Table ke Postgresql

In [22]:
customer = pd.DataFrame({'id':[23,54,78,21], 'nama':['a','b','c','c'],'negara':'indonesia'})

In [23]:
customer

   id nama     negara
0  23    a  indonesia
1  54    b  indonesia
2  78    c  indonesia
3  21    c  indonesia

In [24]:
customer.to_sql('customer',con=eng_postgre,index=False)

4

In [28]:
with eng_postgre.connect() as con:
    value = con.execute(text('select * from customer'))

value.fetchall()

[(23, 'a', 'indonesia'),
 (54, 'b', 'indonesia'),
 (78, 'c', 'indonesia'),
 (21, 'c', 'indonesia')]